app/views/cart/checkout.html.erb

INSERT INTO "orderitems" ("order_id", "product_id", "quantity", "subtotal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["order_id", 29], ["product_id", 22], ["quantity", 1], ["subtotal", 10], ["created_at", 2016-08-19 10:02:15 UTC], ["updated_at", 2016-08-19 10:02:15 UTC]]
INSERT INTO "orders" ("customer_id", "deliveryaddress", "status", "created_at", "updated_at", "totalprice") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["customer_id", 18], ["deliveryaddress", "Zoetermeer"], ["status", "open"], ["created_at", 2016-08-19 10:02:15 UTC], ["updated_at", 2016-08-19 10:02:15 UTC], ["totalprice", 200]]
---
<% @q = v %>
<% Orderitem.create(order: @order, product_id: @c, quantity: @q, subtotal: @p) %>

UPDATE "orders" SET "updated_at" = $1, "totalprice" = $2 WHERE "orders"."id" = $3  [["updated_at", 2016-08-19 13:50:55 UTC], ["totalprice", 1050], ["id", 85]]
---
<% end %>
<% @order.update_attributes( totalprice: totalprice ) %>