app/views/cart/index.html.erb

<% @cart.each do | id, quantity | %>
  <% product = Product.find_by_id(id) %>
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]