app/controllers/cart_controller.rb

  def checkout
      @order = Order.create(customer: current_customer, deliveryaddress: "Hoorn", status: "Closed")
---
INSERT INTO "orders" ("customer_id", "deliveryaddress", "status", "created_at", "updated_at", "totalprice") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["customer_id", 18], ["deliveryaddress", "Zoetermeer"], ["status", "open"], ["created_at", 2016-08-19 10:02:15 UTC], ["updated_at", 2016-08-19 10:02:15 UTC], ["totalprice", 200]]